Mesh_180000_test/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2112                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    inlet
    {
        type            patch;
        nFaces          207;
        startFace       362334;
    }
    outlet
    {
        type            patch;
        nFaces          207;
        startFace       362541;
    }
    topwall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          713;
        startFace       362748;
    }
    bottomwall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          713;
        startFace       363461;
    }
    cylinder
    {
        type            wall;
        inGroups        1(wall);
        nFaces          508;
        startFace       364174;
    }
    frontAndBackPlanes
    {
        type            empty;
        inGroups        1(empty);
        nFaces          363508;
        startFace       364682;
    }
)

// ************************************************************************* //
