Mesh_180000_test/0/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2112                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet
    {
        type            fixedFluxPressure;
        rho             rhok;
        value           uniform 0;
    }

    outlet
    {
        type            fixedValue;   // reference p_rgh
        value           uniform 0;
    }

    topwall
    {
        type            fixedFluxPressure;
        rho             rhok;
        value           uniform 0;
    }

    bottomwall
    {
        type            fixedFluxPressure;
        rho             rhok;
        value           uniform 0;
    }

    cylinder
    {
        type            fixedFluxPressure;
        rho             rhok;
        value           uniform 0;
    }

    frontAndBackPlanes
    {
        type            empty;
    }
}

// ************************************************************************* //
