Mesh_180000_test/0/alphat
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2112                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      alphat;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// zero turbulence diffusivity for laminar flow

dimensions      [0 2 -1 0 0 0 0];   // m2/s, thermal diffusivity

internalField   uniform 0;

boundaryField
{
    inlet
    {
        type            calculated;
        value           uniform 0;
    }

    outlet
    {
        type            calculated;
        value           uniform 0;
    }

    topwall
    {
        type            zeroGradient;
        Prt             0.85;
        value           uniform 0;
    }

    bottomwall
    {
        type            zeroGradient;
        Prt             0.85;
        value           uniform 0;
    }

    cylinder
    {
        type            zeroGradient;
        Prt             0.85;
        value           uniform 0;
    }

    frontAndBackPlanes
    {
        type            empty;
    }
}


// ************************************************************************* //
