Mesh_180000_test/0/omega
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2112                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

internalField   uniform 637.7170883; 

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 637.7170883;    // omega for Re = 4·10^5;
    }

    outlet
    {
        type            zeroGradient;
    }

    topwall
    {
        type            omegaWallFunction;
        value           uniform 1e8;
    }

    bottomwall
    {
        type            omegaWallFunction;
        value           uniform 1e8;
    }

    cylinder
    {
        type            fixedValue;
        value           uniform 1e8;
    }

    frontAndBackPlanes
    {
        type            empty;
    }
}


// ************************************************************************* //
